{    "class_name": "Sequential",    "config": [        {            "class_name": "Merge",            "config": {                "concat_axis": -1,                "dot_axes": [                    -1,                    -1                ],                "layers": [                    {                        "class_name": "Sequential",                        "config": [                            {                                "class_name": "Dense",                                "config": {                                    "W_constraint": null,                                    "W_regularizer": null,                                    "activation": "tanh",                                    "activity_regularizer": null,                                    "b_constraint": null,                                    "b_regularizer": null,                                    "batch_input_shape": [                                        null,                                        4096                                    ],                                    "bias": true,                                    "init": "glorot_uniform",                                    "input_dim": 4096,                                    "input_dtype": "float32",                                    "name": "dense_1",                                    "output_dim": 1024,                                    "trainable": true                                }                            }                        ]                    },                    {                        "class_name": "Sequential",                        "config": [                            {                                "class_name": "Embedding",                                "config": {                                    "W_constraint": null,                                    "W_regularizer": null,                                    "activity_regularizer": null,                                    "batch_input_shape": [                                        null,                                        26                                    ],                                    "dropout": 0.0,                                    "init": "uniform",                                    "input_dim": 12602,                                    "input_dtype": "int32",                                    "input_length": 26,                                    "mask_zero": false,                                    "name": "embedding_1",                                    "output_dim": 300,                                    "trainable": false                                }                            },                            {                                "class_name": "LSTM",                                "config": {                                    "U_regularizer": null,                                    "W_regularizer": null,                                    "activation": "tanh",                                    "b_regularizer": null,                                    "batch_input_shape": [                                        null,                                        26,                                        300                                    ],                                    "consume_less": "cpu",                                    "dropout_U": 0.0,                                    "dropout_W": 0.0,                                    "forget_bias_init": "one",                                    "go_backwards": false,                                    "init": "glorot_uniform",                                    "inner_activation": "hard_sigmoid",                                    "inner_init": "orthogonal",                                    "input_dim": 300,                                    "input_dtype": "float32",                                    "input_length": null,                                    "name": "lstm_1",                                    "output_dim": 512,                                    "return_sequences": true,                                    "stateful": false,                                    "trainable": true,                                    "unroll": false                                }                            },                            {                                "class_name": "Dropout",                                "config": {                                    "name": "dropout_1",                                    "p": 0.0,                                    "trainable": true                                }                            },                            {                                "class_name": "LSTM",                                "config": {                                    "U_regularizer": null,                                    "W_regularizer": null,                                    "activation": "tanh",                                    "b_regularizer": null,                                    "consume_less": "cpu",                                    "dropout_U": 0.0,                                    "dropout_W": 0.0,                                    "forget_bias_init": "one",                                    "go_backwards": false,                                    "init": "glorot_uniform",                                    "inner_activation": "hard_sigmoid",                                    "inner_init": "orthogonal",                                    "input_dim": 512,                                    "input_length": null,                                    "name": "lstm_2",                                    "output_dim": 512,                                    "return_sequences": false,                                    "stateful": false,                                    "trainable": true,                                    "unroll": false                                }                            },                            {                                "class_name": "Dropout",                                "config": {                                    "name": "dropout_2",                                    "p": 0.0,                                    "trainable": true                                }                            },                            {                                "class_name": "Dense",                                "config": {                                    "W_constraint": null,                                    "W_regularizer": null,                                    "activation": "tanh",                                    "activity_regularizer": null,                                    "b_constraint": null,                                    "b_regularizer": null,                                    "bias": true,                                    "init": "glorot_uniform",                                    "input_dim": null,                                    "name": "dense_2",                                    "output_dim": 1024,                                    "trainable": true                                }                            }                        ]                    }                ],                "mode": "mul",                "mode_type": "raw",                "name": "merge_1",                "output_shape": null,                "output_shape_type": "raw"            }        },        {            "class_name": "Dropout",            "config": {                "name": "dropout_3",                "p": 0.0,                "trainable": true            }        },        {            "class_name": "Dense",            "config": {                "W_constraint": null,                "W_regularizer": null,                "activation": "tanh",                "activity_regularizer": null,                "b_constraint": null,                "b_regularizer": null,                "bias": true,                "init": "glorot_uniform",                "input_dim": null,                "name": "dense_3",                "output_dim": 1000,                "trainable": true            }        },        {            "class_name": "Dropout",            "config": {                "name": "dropout_4",                "p": 0.0,                "trainable": true            }        },        {            "class_name": "Dense",            "config": {                "W_constraint": null,                "W_regularizer": null,                "activation": "softmax",                "activity_regularizer": null,                "b_constraint": null,                "b_regularizer": null,                "bias": true,                "init": "glorot_uniform",                "input_dim": null,                "name": "dense_4",                "output_dim": 1000,                "trainable": true            }        }    ]}